{
    "title": "Team Structure & Organization",
    "description": "The AI-Ready Nurses initiative is led through a collaborative, nursing-centered structure that brings together statewide workforce leadership, academic nursing expertise, and applied computer science.",
    "closingStatement": "Together, these partners operate under a shared governance model coordinated by OCN, with regular cross-organizational collaboration to ensure the initiative remains nursing-first, ethically grounded, and scalable across healthcare and education systems.",
    "organizations": [
        {
            "name": "Oklahoma Center for Nursing",
            "link": "https://okcenterfornursing.org/",
            "description": "The Oklahoma Center for Nursing (OCN) serves as the lead and coordinating organization, providing overall project leadership, fiscal oversight, reporting, and statewide workforce alignment. OCN ensures the framework reflects real nursing workforce needs across urban, rural, and frontier communities in Oklahoma and supports dissemination and adoption across education and practice settings.",
            "people": [
                {
                    "name": "Patrice Greenawalt",
                    "title": "Executive Director of the Oklahoma Center for Nursing (MS, RN (PI))",
                    "description": "Patrice Greenawalt provides overall project leadership and strategic direction, bringing 45 years of clinical and leadership experience in nursing. She oversees coordination across partners, ensures alignment with statewide workforce priorities, and guides dissemination and adoption across healthcare and education settings.",
                    "image": "/assets/patrice-greenawalt.jpg",
                    "imagePosition": "left"
                }
            ]
        },
        {
            "name": "OU Health Campus College of Nursing",
            "link": "https://www.ouhsc.edu/",
            "description": "The OU Health Campus College of Nursing leads educational strategy, curriculum integration, and credential design. Faculty leadership ensures the stackable credentials align with nursing competencies, accreditation standards, and pathways spanning pre-licensure education, continuing education, and workforce development. The College also oversees evaluation related to learner confidence, readiness, and adoption.",
            "people": [
                {
                    "name": "Helina Hoyt",
                    "title": "OU Health Campus College of Nursing (PhD, RN, PHN (Co‑PI))",
                    "description": "Dr. Helina Hoyt leads educational strategy, credential design, and integration across nursing education and continuing education, grounded in evidence‑based and innovative practice.",
                    "image": "/assets/helina-hoyt.jpg",
                    "imagePosition": "right"
                },
                {
                    "name": "Karina Shreffler",
                    "title": "OU Health Campus College of Nursing (PhD (Co‑PI))",
                    "description": "Dr. Karina Shreffler leads evaluation and outcomes measurement related to workforce readiness, confidence, and adoption.",
                    "image": "/assets/karina-shreffler.jpg",
                    "imagePosition": "left"
                }
            ]
        },
        {
            "name": "OU School of Computer Science",
            "link": "https://www.ou.edu/coe/cs",
            "description": "The University of Oklahoma School of Computer Science leads technical design and applied AI learning, developing sandboxed, non-clinical environments that allow nurses to engage with AI safely and ethically. Computer Science faculty collaborate closely with nursing leaders to translate AI concepts into accessible, practice-relevant learning experiences.",
            "people": [
                {
                    "name": "Ze Shi Li",
                    "title": "OU School of Computer Science (PhD (Co‑PI))",
                    "description": "Dr. Ze Shi Li leads development of the sandboxed AI learning environment and applied learning activities.",
                    "image": "/assets/ze-shi-li.jpg",
                    "imagePosition": "right"
                },
                {
                    "name": "Sridhar Radhakrishnan",
                    "title": "OU School of Computer Science (PhD (Co‑PI))",
                    "description": "Dr. Sridhar Radhakrishnan leads development of the sandboxed AI learning environment and applied learning activities.",
                    "image": "/assets/sridhar-radhakrishnan.jpg",
                    "imagePosition": "left"
                },
                {
                    "name": "Sean Mackay",
                    "title": "OU School of Computer Science (PhD (Co‑PI))",
                    "description": "Dr. Sean Mackay leads pedagogy-driven educational design, bringing expertise in computing education research and educational software development.",
                    "image": "/assets/sean-mackay.jpg",
                    "imagePosition": "right"
                }
            ]
        }
    ]
}